# GetOffset Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IPointCloudAccess..::..GetOffset Method
IPointCloudAccess Interface See Also
---
Implement this method to return the offset stored in the point cloud.
**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
XYZ GetOffset()
```

Visual Basic
---
```text
Function GetOffset As XYZ
```

Visual C++
---
```text
XYZ^ GetOffset()
```

# ### Return Value
The offset vector of this point cloud's coordinate system.
# Remarks
All points are assumed to be offset by the same offset vector. The offset should be expressed in the same units as used by the point coordinates (the scale conversion factor is not applied). The offset will be used by Revit if the user chooses to place an instance relative to another point cloud (the "Auto - Origin To Last Placed" placement option).
# See Also
IPointCloudAccess Interface
Autodesk.Revit.DB.PointClouds Namespace